const questionsSet = {
  "0": {questions: ["影视题0","影视题1","影视题2","影视题3","影视题4","影视题5","影视题6","影视题7","影视题8","影视题9"],
        answered:8},
  "1":{questions: ["体育题0", "体育题1", "体育题2", "体育题3", "体育题4", "体育题5", "体育题6", "体育题7", "体育题8", "体育题9"],
      answered:0},
  "2":{questions: ["明星0", "明星1", "明星2", "明星3", "明星4", "明星5", "明星6", "明星7", "明星8", "明星9"],
      answered:0},
  "3":{questions: ["文学0", "文学1", "文学2", "文学3", "文学4", "文学5", "文学6", "文学7", "文学8", "文学9"],
      answered:0},
  "4":{questions: ["地理0", "地理1", "地理2", "地理3", "地理4", "地理5", "地理6", "地理7", "地理8", "地理9"],
      answered:0},
  "5":{questions: ["成语0", "成语1", "成语2", "成语3", "成语4", "成语5", "成语6", "成语7", "成语8", "成语9"],
      answered:0},
}
// let results = []
// for (let i = 0; i < 10; i++){
//   results.push("成语"+i)
// }
// console.log(results)